[
  {
    "db_name": "astockbasicinfodb",
    "db_desc": "本库名为“上市公司基本资料”，记录了上市公司在经营、名称变更及行业信息等方面的详细资料；涵盖了公司概况（如联系方式、注册信息、行业与产品、证券品种等），公司名称更改状况（如中英文名称变更及相关公告信息），以及公司经营范围与行业变更（如主营业务、行业分类及相关决策信息）；方便用户全面了解上市公司的基本信息、动态变更及行业涉足情况，支持企业研究、投资分析与市场追踪等需求。"
  },
  {
    "db_name": "astockeventsdb",
    "db_desc": "本库名为上市公司公告资讯/重大事项，记录了上市公司公告中披露的各种重大事项，包括公司担保、借贷、诉讼仲裁、委托理财、资产重组、重大经营合同以及投资者关系活动等。涵盖了从2001年至今的各类信息，数据来源包括上市公司公告、巨潮资讯、上交所互动易和深交所互动易。具体表包括公司担保明细、公司借贷明细、公司诉讼仲裁明细、重大事项委托理财、公司资产重组明细、公司重大经营合同明细、投资者关系活动及其调研明细等。每个表详细记录了事件相关的时间、主体、进展、财务数据、合同信息、调研活动等多维度信息，方便用户对上市公司的重大事项进行综合分析和管理。"
  },
  {
    "db_name": "astockfinancedb",
    "db_desc": "本库名为上市公司财务指标/财务报表/融资与分红，记录了上市公司在不同财务方面的详细数据。涵盖了A股增发、配股、公司分红、资金投向、资产负债表、利润分配表、现金流量表、公司研发投入、主营业务构成、经营情况述评以及审计意见等多个方面。通过这些数据，用户可以详细了解企业的融资活动、财务健康状况、研发投入与产出、经营状况、审计意见以及主营业务的构成和变化趋势等，方便用户进行财务分析、投资决策和市场研究。"
  },
  {
    "db_name": "astockindustrydb",
    "db_desc": "本库名为“上市公司行业板块”，记录了A股上市公司在行业划分、行业变更、估值指标、财务指标及概念板块等多个方面的信息；涵盖了公司所属行业的多层级划分、变更历史、行业估值和财务表现，以及与热点概念相关的分类和公司归属信息；方便用户进行行业分析、公司数据回测、估值计算及热点概念挖掘，助力投资决策。"
  },
  {
    "db_name": "astockmarketquotesdb",
    "db_desc": "本库名为“上市公司股票行情”，记录了境内股票、基金、债券等证券的交易行情、技术指标、资金流向、技术形态、停复牌信息等全面数据；涵盖了每日行情、成交量技术指标、资金流向统计、技术形态表现、停复牌记录等多个维度，提供了从基础的价格、成交量、成交金额等核心数据，到资金流入流出、技术指标、历史表现统计、风险指标（如β值、夏普比率、波动率）等深度分析数据；方便用户进行证券交易的多维度分析，包括市场趋势研判、资金流向追踪、技术形态识别、风险评估以及停复牌信息查询，为投资决策提供全面支持。"
  },
  {
    "db_name": "astockoperationsdb",
    "db_desc": "本库名为“上市公司产品供销/人力资源”，记录了A股上市公司在供应商与客户关系、职工构成以及管理层报酬统计等方面的重要信息，涵盖了从2015年至今的企业关联交易数据、1999年至今的员工构成数据，以及2001年至今的管理层报酬统计数据，方便用户研究企业的供销链关系、员工结构特征及高管薪酬水平。数据库包含以下三张表：1. 表“公司供应商与客户”（lc_suppcustdetail），记录了企业关联交易的详细信息，包括信息发布日期、来源、公司代码、关联企业名称及属性、交易标的、交易金额及占比等；2. 表“公司职工构成”（lc_staff），包含公司员工的分类与统计信息，如分类方式、类别名称、员工数量、年龄范围、占比等；3. 表“公司管理层报酬统计”（lc_rewardstat），统计了管理层报酬总额、前三名董事及高管的报酬、独立董事津贴等信息，便于进行薪酬分析和行业对比。"
  },
  {
    "db_name": "astockshareholderdb",
    "db_desc": "本数据库名为“上市公司股东与股本/公司治理”，记录了上市公司股东、股本及公司治理相关的详细信息；涵盖了股东分类、持股情况、股东大会出席信息、股本结构变动、股份回购、股权转让、质押冻结、员工持股计划等多方面数据，涉及股东基本属性、持股数量及比例、股权变动原因、股份回购金额及价格、员工持股计划规模及资金来源等内容；通过细致的字段设计，如公司代码、股东名称、持股比例、股权变动时间、股份类别、事件进程等，方便用户分析股东结构、股本流动、公司治理情况以及相关历史变动趋势，为企业管理、投资决策及研究提供全面的数据支持。"
  },
  {
    "db_name": "constantdb",
    "db_desc": "本库名为“常量库”，记录了证券、交易日、地区代码以及系统常量等多维信息；涵盖了证券的基础属性与交易信息（如证券主表secumain、港股证券主表hk_secumain、美股证券主表us_secumain，字段包括证券代码、名称、上市日期、市场类别、ISIN代码等核心属性）、交易日的周期特性（如交易日表qt_tradingdaynew，记录日期是否为交易日及是否为周、月、季、年末交易日等）、行政区域划分与国际地区编码（如国家城市代码表lc_areacode，字段涉及地区编码、名称、层级结构及有效状态等）、以及系统常量的分类与值（如系统常量表ct_systemconst，记录常量分类、描述及浮点值、整型值、日期值等多类型常量）；方便用户全面查询证券信息、获取交易日属性、管理地区划分及系统常量，为金融数据分析与管理提供了强大的支持。"
  },
  {
    "db_name": "creditdb",
    "db_desc": "本库名为诚信数据库，记录了与违规事件相关的处罚信息；涵盖了违规当事人处罚表，详细记录单个事件下单个当事人的每一个处罚，包括标识信息（如记录ID、事件代码）、当事人信息（如名称、性质、编码）、时间信息（如起始和结束日期）、违规及处罚信息（如违规条款、说明、处罚类型、机构、涉及金额、计价货币）、关联信息（如关联上市公司）等；方便用户全面了解2014年至今的违规事件及其处罚情况，并支持从交易所、上市公司公告、证监会等来源进行追溯。"
  },
  {
    "db_name": "hkstockdb",
    "db_desc": "本库名为港股数据库，记录了港股相关的多维度信息；涵盖了港股公司员工数量变动历史、公司基本概况以及股票行情表现等内容；通过三张表提供详细数据支持：港股公司员工数量变动表记录了公司员工数量的变动历史，包括变更前后数量、生效日期等；港股公司概况表全面描述了公司基本信息，如成立日期、注册资本、行业分类、管理层信息等；港股行情表现表详尽追踪了股票的交易数据及多周期表现指标，包括价格、成交、涨跌、市值等，方便用户进行港股公司信息查询、员工动态分析及股票行情研究。"
  },
  {
    "db_name": "indexdb",
    "db_desc": "本库名为指数数据库，记录了市场上主要指数的基本情况及其成份证券构成信息；涵盖了指数的标识、行业分类、发布编制信息、设计特性、成份证券属性等多方面内容；方便用户全面了解指数的基本属性及成份股变动情况，实现对指数的深入分析与管理支持。"
  },
  {
    "db_name": "institutiondb",
    "db_desc": "本库名为“机构数据库”，记录了市场上重要机构的基本资料、事件分类体系及证券舆情信息；涵盖了机构基本信息、联系方式、管理层信息、注册信息、经营信息、存续状态，事件分类及层级关系，证券相关事件及情感分析等多方面内容；方便用户查询机构详细资料、管理事件分类体系及分析证券舆情情感数据。"
  },
  {
    "db_name": "publicfunddb",
    "db_desc": "本库名为公募基金数据库，记录了公募基金的基本信息、产品名称、管理人概况及分红数据；涵盖了基金的设立与运作特性、交易所披露名称、管理公司信息及历史分红记录等内容；方便用户全面了解基金的基础属性、管理人背景、分红情况及相关规则，支持投资决策和数据分析。"
  },
  {
    "db_name": "usstockdb",
    "db_desc": "本库名为美股数据库，记录了美国市场上市公司的基本信息和证券交易的日行情数据；涵盖了美股公司概况表（us_companyinfo），包含公司代码、名称、地址、联系方式、公司简介、注册地、成立日期、公司类型等字段，用于全面描述公司基本情况；以及美股日行情表（us_dailyquote），包含交易日、证券代码、开盘价、收盘价、成交量、涨跌幅等字段，用于记录和分析证券的日交易表现；方便用户查询美股公司信息及进行证券市场的历史行情分析与研究。"
  }
]