[
  {
    "db_name": "astockbasicinfodb",
    "db_desc": "本库名为“上市公司基本资料”，记录了上市公司的核心信息及变更情况；涵盖了公司概况、名称更改状况、经营范围与行业变更三大方面。具体包括公司基本信息、联系方式、注册及办公地址、证券信息、高管及顾问信息、名称变更历史、业务范围及行业分类等详细数据。方便用户全面了解上市公司的基础资料、历史变迁及业务发展，为投资决策、研究分析提供有力支持。"
  },
  {
    "db_name": "astockeventsdb",
    "db_desc": "本库名为“上市公司公告资讯/重大事项”，记录了上市公司公告中披露的担保、借贷、诉讼仲裁、委托理财、资产重组、重大经营合同及投资者关系活动等重大事项；涵盖了公司代码、信息发布日期、事件内容、主体与交易对象信息、财务数据、协议签署情况、进展状态、关联关系、担保与借贷细节、诉讼仲裁状态、委托理财条款、资产重组财务指标、合同标的与期限、调研活动详情等字段；方便用户全面了解上市公司重大事项的详细信息，进行数据分析和决策支持。"
  },
  {
    "db_name": "astockfinancedb",
    "db_desc": "本库名为上市公司财务指标/财务报表/融资与分红，记录了A股增发、A股配股、公司分红、资金投向说明、资产负债表_新会计准则、利润分配表_新会计准则、现金流量表_新会计准则、公司研发投入与产出、公司主营业务构成、公司经营情况述评、公司历年审计意见等数据，涵盖了证券发行全流程信息、配股相关信息、分红情况、募资及收购兼并相关信息、公司财务报表详细信息、公司财务信息、公司财务及现金流量详细信息、公司研发投入及相关人员信息、公司经营信息、公司经营状况及相关信息披露时间、公司审计相关信息等，方便用户全面了解上市公司的财务状况、经营情况、审计意见等信息。"
  },
  {
    "db_name": "astockindustrydb",
    "db_desc": "本库名为“上市公司行业板块”，记录了上市公司在多种行业划分标准下的所属行业情况及其变更历史，涵盖了公司行业划分表、公司行业变更表、行业估值指标、行业财务指标表、概念所属公司表及概念板块常量表；方便用户进行公司行业分类查询、行业变更追溯、多维度财务指标分析及概念板块信息检索，支持投资者数据回测、行业估值计算及市场热点概念分析。"
  },
  {
    "db_name": "astockmarketquotesdb",
    "db_desc": "本库名为上市公司股票行情，记录了境内股票交易资金流向指标、境内股票成交量技术指标、股票技术形态表、日行情表、股票行情表现(新)、停牌复牌表；涵盖了证券交易的多维度数据，包括证券内部编码、交易日期、成交时间区间、成交额、成交量、成交笔数等交易细节，以及从小单到超大单各级别订单的流入额、流出额、流入量、流出量、流入笔数、流出笔数等交易细节，涵盖主动与被动交易情况，并计算了各级订单的净流入额、净流入量、买入率、卖出率、净买入率及其与流通市值和股本的比值，全面反映了市场交易动态及主力资金流向；方便用户进行证券交易的多维度数据分析和决策。"
  },
  {
    "db_name": "astockoperationsdb",
    "db_desc": "本库名为“上市公司产品供销/人力资源”，记录了A股上市公司在产品供销和人力资源管理方面的详细信息；涵盖了公司供应商与客户清单、交易标的及金额、职工构成情况、管理层报酬统计等多个维度数据。具体包括公司供应商与客户的交易信息（如发布日期、公司代码、交易金额及占比）、职工的技术职称、专业、文化程度及年龄分布、管理层报酬总额及前三名董事和高管的报酬情况等。数据范围从1999年至今，信息来源包括招股说明书和定期报告等。方便用户全面了解上市公司的供销关系、人力资源配置及管理层薪酬状况，为投资决策和企业管理提供有力支持。"
  },
  {
    "db_name": "astockshareholderdb",
    "db_desc": "本库名为上市公司股东与股本/公司治理，记录了上市公司的股东信息、股本结构、公司治理等方面的详细数据。涵盖了股东类型分类、股东名单、股东户数、大股东介绍、公司实际控制人、公司股本结构变动、股东持股统计、股东股权变动、股东股权冻结和质押、股东股权冻结和质押统计、股份回购、股份回购关联表、法人配售与战略投资者、A股国家队持股统计、外资持股统计、员工持股计划、员工持股计划概况、股东增减持计划表、股东大会出席信息等数据表。方便用户了解上市公司的股权结构、股东情况、公司治理等信息，为投资决策提供参考。"
  },
  {
    "db_name": "constantdb",
    "db_desc": "本库名为常量库，记录了证券市场、系统常量及地区编码等多维度数据；涵盖了证券主表（含股票、基金、债券基础信息）、港股及美股证券主表（境外市场证券信息）、系统常量表（各类常量值）、交易日表（市场交易日信息）以及国家城市代码表（全球及中国行政区域划分）；方便用户查询证券基本信息、市场交易状态、常量数据及地区编码，支持多场景数据分析和决策支持。"
  },
  {
    "db_name": "creditdb",
    "db_desc": "本库名为诚信数据库，记录了违规当事人处罚的详细信息；涵盖了事件唯一标识、事件代码、当事人信息（名称、性质、编码）、事件时间范围（起始日期、结束日期）、违规详情（条款、说明）、处罚情况（机构、类型、说明、机构编码）、涉及金额及货币、关联上市公司及处罚类型更新，并提供公告标识；方便用户查询和分析2014年至今由交易所、上市公司公告、证监会等来源的违规事件及其处罚情况。"
  },
  {
    "db_name": "hkstockdb",
    "db_desc": "本库名为港股数据库，记录了港股公司员工数量变动、公司概况及行情表现等全面信息；涵盖了员工数量变动历史、公司基础信息如成立日期、注册资本、业务范围及联系方式，以及股票行情的详细统计数据如价格、成交量、涨跌幅等，时间跨度从2001年至今；方便用户深入了解港股公司运营状况、市场表现及历史趋势，为投资决策提供有力支持。"
  },
  {
    "db_name": "indexdb",
    "db_desc": "本库名为指数数据库，记录了市场上主要指数的基本情况和成份证券构成信息；涵盖了指数的类别、成份证券类别、发布机构、发布日期、基期基点、加权方式、成份证券市场代码、入选删除日期等详细信息，数据源包括中证指数有限公司、上海证券交易所等多家机构；方便用户全面了解指数特征和成份变化，支持深入分析和决策。"
  },
  {
    "db_name": "institutiondb",
    "db_desc": "本库名为机构数据库，记录了市场上重要机构如证券公司、信托公司、保险公司的基本资料及全网披露的舆情信息；涵盖了机构基本资料表（含公司代码、注册资本、联系方式等）、事件体系指引表（含事件名称、代码及级别）及证券舆情表（含证券编码、事件信息及情感分析）；方便用户全面了解机构背景、事件分类及舆情动态，助力投资决策与风险管控。"
  },
  {
    "db_name": "publicfunddb",
    "db_desc": "本库名为“公募基金数据库”，记录了公募基金的综合信息；涵盖了基金概况（包括基金规模、成立日期、投资类型、管理人、托管人等）、产品名称（交易所披露简称、集中申购简称等）、管理人概况（成立日期、注册资本、法人代表等）、分红信息（分红比例、登记日、除息日等）等多个维度；方便用户全面了解基金基本信息、投资特性、运作方式、收益分配、基金经理及机构情况、申赎规则等，为基金投资决策提供详实数据支持。"
  },
  {
    "db_name": "usstockdb",
    "db_desc": "本库名为美股数据库，记录了美国市场上市公司的基本情况和证券日收盘行情；涵盖了公司代码、中英文名称、地址、联系方式、公司简介、成立日期、公司类型、注册地、总部标识、链接地址等公司信息，以及交易日期、证券代码、开盘价、最高价、最低价、收盘价、涨跌幅、成交量、成交额、每股收益、总市值、总股本等证券交易核心数据；方便用户全面了解美股市场动态和公司基本面，进行投资分析和决策。"
  }
]